[{"id":1484360336639,"text":"Hackers and ethical hackers use the same tools and techniques.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Hackers and Ethical hackers use the same tools and techniques, but differ in consent. Ethical hackers do not exploit weaknesses and reveal all the information about the potential vulnerabilities of the system to the admin. Hackers gain unauthorized access and can cause damage.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484360401129,"text":"Ethical hacking cannot:","answers":[{"text":"Perform security analysis","isValid":false},{"text":"Prioritize threats","isValid":false},{"text":"Test resources","isValid":false},{"text":"Exploit vulnerabilities","isValid":true}],"note":"Ethical hacking focuses on improving security by identifying the weaknesses and vulnerabilities of the system. In contrast to unethical hacking, the ethical hackers do not exploit the flaw; they reveal all the information to the users.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484360526203,"text":"A hacker needs to be a good programmer as many hacking software programs have ready-made exploits that can be launched against a computer system or network. Identify the uses of exploits.","answers":[{"text":"A. Initial attack","isValid":false},{"text":"B. Expose vulnerability","isValid":false},{"text":"C. Steal data","isValid":false},{"text":"D. Gain privilege escalation","isValid":false},{"text":"E. Answers A, B and D","isValid":true}],"note":"Hackers concentrate on exploits to open the doors to an initial attack. Exploits are pieces of software used to detect the vulnerabilities of a system. The ethical hacker will update the admin with the latest discovered vulnerabilities. The exploits take advantage of a bug to gain unauthorized access to the system and privilege escalation to intrude into the system.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484360600704,"text":"Which of the following is not the key term of the CIA triad?","answers":[{"text":"Exploits","isValid":true},{"text":"Availability","isValid":false},{"text":"Confidentiality","isValid":false},{"text":"Integrity","isValid":false}],"note":"Confidentiality, integrity, and availability are the basic tenets of information system security and are the key terms of the CIA triad.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484360664389,"text":"Identify the key principle in the CIA triad that prevents denial-of-service (DoS) attacks.","answers":[{"text":"Integrity","isValid":false},{"text":"Availability","isValid":true},{"text":"Confidentiality","isValid":false}],"note":"Availability is ensured by performing all the hardware maintenance, updating software to the current version, and providing adequate communication bandwidth.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484360733272,"text":"Confidentiality makes use of","answers":[{"text":"Data encryption","isValid":true},{"text":"Backup copies","isValid":false},{"text":"Necessary system upgrades","isValid":false}],"note":"Data encryption is one of the common methods to ensure confidentiality. A number of security protocols work in conjunction with the SSL/TLS to ensure security of data over the Internet. Use of user IDs and passwords constitute a standard procedure to ensure confidentiality.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484360793954,"text":"If it is legal and within the scope of the project, the pen tester can undertake war dialing to detect listening modems and war dialing to discover vulnerable access points.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"If it is legal and within the scope of the project, then the pen tester can undertake war dialing to detect listening modems and war driving to discover vulnerable access points.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484360878654,"text":"This term is not used in hacking circles.","answers":[{"text":"Vulnerabilities","isValid":false},{"text":"Exploits","isValid":false},{"text":"Integrity","isValid":true},{"text":"Zero-day attack","isValid":false}],"note":"Integrity is one of the key principles in the CIA triad. It ensures that only authorized persons edit the data.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361165831,"text":"A vulnerability with one or more known instances of working and fully implemented attacks is classified as:","answers":[{"text":"Exploitable vulnerability","isValid":true},{"text":"Window of vulnerability","isValid":false},{"text":"Attack surface","isValid":false}],"note":"A vulnerability with one or more known instances of working and fully implemented attacks is classified as an exploitable vulnerability.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361252024,"text":"From discovery until disclosure, it is a:","answers":[{"text":"Black risk","isValid":true},{"text":"White risk","isValid":false},{"text":"Gray risk","isValid":false}],"note":"From discovery until disclosure of a vulnerability, the black hats use their skill for malicious purposes.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361368048,"text":"Choose the one that doesn't belong.","answers":[{"text":"Zero-day attacks","isValid":false},{"text":"Natural threat","isValid":true},{"text":"Exploits","isValid":false},{"text":"Malware","isValid":false}],"note":"As the name implies, natural threats can be any disaster caused by nature. It can be a flood or hurricane, causing impact on the availability of the systems.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361467790,"text":"Identify the term not associated with confidentiality.","answers":[{"text":"User IDs & passwords","isValid":false},{"text":"EMP","isValid":true},{"text":"SSL/TLS","isValid":false},{"text":"Biometrics","isValid":false}],"note":"EMP, or electromagnetic pulse, is related with integrity to ensure that only authorized persons access the data.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361526588,"text":"What is the primary goal of using exploits?","answers":[{"text":"Gain low-level access, escalate privileges repeatedly, and reach the root","isValid":true},{"text":"Unauthorized data access","isValid":false},{"text":"DoS","isValid":false},{"text":"Superuser-level access","isValid":false}],"note":"The main goal of exploits is to gain low-level access to the system. After gaining low-level access, it escalates the privilege repeatedly until the hacker reaches the root.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361642124,"text":"The hackers who hack with permission from the data owner are known as:","answers":[{"text":"Gray risk hackers","isValid":false},{"text":"Black risk hackers","isValid":false},{"text":"White risk hackers","isValid":true}],"note":"White risk hackers are ethical hackers, who use their knowledge to find out the vulnerabilities in the computer system and help in the implementation of countermeasures.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361707249,"text":"For implementing the defense-in-depth strategies on the data layer, you could have:","answers":[{"text":"Firewalls","isValid":false},{"text":"Encryption","isValid":true},{"text":"HIDS","isValid":false},{"text":"Antivirus","isValid":false}],"note":"Encryptions and ACL are used in the data layer.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361750884,"text":"Which is the conventional approach to penetration testing?","answers":[{"text":"External testing","isValid":true},{"text":"Internal testing","isValid":false}],"note":"External penetration testing is the conventional approach to penetration testing that focuses on the servers, infrastructure, and underlying software pertaining to the target. No prior knowledge of the site or full disclosure of the topology and environment are required to perform this test.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361808050,"text":"Name the penetration test in which the pen testers have partial knowledge or information about the system and environment.","answers":[{"text":"White-box testing","isValid":false},{"text":"Gray-box testing","isValid":true},{"text":"Black-box testing","isValid":false}],"note":"The pen tester conducts the tests with limited or partial knowledge about infrastructure, defense mechanism, and communication channels of the target.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361873893,"text":"The following are true about a penetration tester, except:","answers":[{"text":"Follows a strict code of ethics","isValid":false},{"text":"Gets authorization before testing","isValid":false},{"text":"Attempts to exploit vulnerabilities","isValid":true},{"text":"Presents a detailed report","isValid":false}],"note":"When a hacker attempts to exploit vulnerabilities, the penetration tester attempts to correct vulnerabilities.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484361950898,"text":"A hacker:","answers":[{"text":"Tries to bypass the logs","isValid":true},{"text":"Will follow techniques that will not cause any damage","isValid":false},{"text":"Attempts to correct vulnerabilities","isValid":false}],"note":"A hacker will always attempt to bypass all the logs in order to remain undetected. In contrast, a pen tester will submit all logs and reports to the organization. Only a pen tester follows a code of ethics; not a hacker.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484362009985,"text":"Which is not a step in penetration testing methodology?","answers":[{"text":"Footprinting","isValid":false},{"text":"Scanning","isValid":false},{"text":"Security analysis","isValid":true},{"text":"Enumeration","isValid":false}],"note":"Evaluation of security levels is a method in penetration testing, which helps the tester to determine the vulnerabilities related to hardware and software.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484362095084,"text":"Choose the one which does not fall into the category of network attacks:","answers":[{"text":"Sniffing","isValid":false},{"text":"ARP poisoning","isValid":false},{"text":"MiTM","isValid":false},{"text":"Authorization","isValid":true}],"note":"Authorization is a type of application attack in which the authorization process is exploited.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484362120891,"text":"Script kiddies are related to zero-day exploits.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"The primary desire of unskilled attackers is to obtain access to zero-day exploits. Such unskilled attackers are nicknamed Script Kiddies.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484362141928,"text":"Multiple implementations of the same basic security tool is a layered approach.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Multiple implementations of the same basic security tool is not a layered approach. Layered security is about multiple types of security measures, each protecting against a different vector of attack.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484362230784,"text":"A hacker who targets an organization's network to gain unauthorized access, and a professional penetration tester are different.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"A professional penetration tester will have the concern of the owner to access the organization network and use his skills to improve the security, without causing any loss or damage. A hacker will have malicious intentions and may cause damage to the network.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484362252383,"text":"A gray hat hacker always hacks the system for offensive purposes.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Grey hackers use their skill for both offensive and defensive purposes, whereas a black hacker uses their knowledge to gain unauthorized access to the system for offensive purposes only. A white hacker always hacks the systems with good intentions.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484362275267,"text":"The implementation of the Incident Management process derives benefits for its IT services only.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"The implementation of the Incident Management process derives benefits for both its IT services and business.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484362328022,"text":"Who are self-proclaimed ethical hackers?","answers":[{"text":"Black hat hackers","isValid":false},{"text":"White hat hackers","isValid":false},{"text":"Gray hat hackers","isValid":true}],"note":"Gray hackers are self-proclaimed ethical hackers. The nature of behavior depends on the situations and can be sometimes offensive or defensive.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484362436147,"text":"In black-box testing, the pen testers choose to undertake black-hat testing to: (Choose all that apply.)","answers":[{"text":" A. Minimize false positives","isValid":false},{"text":"B. Simulate real-world attacks","isValid":false},{"text":"C. Simulate an inside attacker who has full privileges","isValid":false},{"text":" D. Simulate attacks performed by an insider or outsider with limited access privileges","isValid":false},{"text":" E. Answers A & B","isValid":true}],"note":"The black hat testers carry out the test with no prior information about the infrastructure of the system to minimize false positives. Before analysis, they determine the location and extent of the systems. The black hat testers will get no assistance from the client and begins tests to simulate real-world attacks and reduce false positives.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484362502277,"text":"In ethical hacking, if you fail to penetrate into a system/network, then:","answers":[{"text":"Try a denial-of-service attack","isValid":true},{"text":"Try to elevate your privileges","isValid":false},{"text":"Try to become an admin","isValid":false},{"text":"Try to alter data","isValid":false}],"note":"If you fail to penetrate into a system/network, then think like a hacker and carry out a denial-of-service attack.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484362524410,"text":"To exploit vulnerability, an attacker need not have an applicable tool or technique that can connect to a system weakness.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"To exploit vulnerability, an attacker must have at least one applicable tool or technique that can connect to a system weakness. In such cases, the vulnerability is also known as the attack surface.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484362544771,"text":"Buffer overflow is a type of Host/OS attacks.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Buffer overflows, SQL injection, and authentication are some of the types of application attacks.","type":"TRUE_FALSE","preserveOrder":false}]