[{"id":1484599457204,"text":"Which of these are the steps of session hijacking?","answers":[{"text":" Tracking the connection","isValid":false},{"text":"Desynchronizing the connection","isValid":false},{"text":" Injecting attacker’s packets","isValid":false},{"text":"All of the above","isValid":true}],"note":"To be able to hijack a session, the attacker will have to predict or calculate the session IDs. He will have to track the connection. To be able to intrude and attack a victim, you will need to take over the session from the victim. You do this by desynchronizing the connection. Once the victim and host are desynchronized, the attacker will inject the spurious packets.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484599503901,"text":"Which of the following is a mechanism used to get session IDs in order to hijack a session?","answers":[{"text":"Brute forcing","isValid":false},{"text":"Session ID stealing","isValid":false},{"text":"Calculating session IDs","isValid":false},{"text":"All of the Above","isValid":true}],"note":"Brute forcing is used to try out various sessions. An attacker can steal IDs from a session. An attacker can calculate the session IDs by observing the patterns.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484599558277,"text":"How does an attacker get session IDs in brute forcing?","answers":[{"text":" Attacker will get the session IDs from others","isValid":false},{"text":"Attacker will try various combinations to guess the session IDs and keeps trying until he succeeds.","isValid":true},{"text":"Attacker will steal the session IDs","isValid":false},{"text":"Attacker will wait for the session to disclose the session ID","isValid":false}],"note":"An attacker tries to guess a session ID until he finds the correct one.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484601872434,"text":"What are the different modes of session hijacking?","answers":[{"text":"A. Active mode","isValid":false},{"text":"B. Passive mode","isValid":false},{"text":"C. Lazy mode","isValid":false},{"text":"D. Wait mode","isValid":false},{"text":"E. Answers A and B","isValid":true}],"note":"Attackers can actively pursue to hijack a session. Attackers can also collate information before attacking. This is done in passive mode.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484601946836,"text":"Which are Session Hijacking Processes?","answers":[{"text":"A. Tracking the connection","isValid":false},{"text":" B. Desynchronizing the connection","isValid":false},{"text":" C. Injecting the attacker's packet","isValid":false},{"text":"D. All of the above","isValid":true}],"note":"A. The attacker waits to find a suitable target and host by using a network sniffer to track the target and host, or to identify a suitable user by scanning with a tool like Nmap to find a target with an easy TCP sequence prediction. B. A desynchronized state is when a connection between the target and host is in the established state, in a stable state with no data transmission, the server's sequence number is not equal to the client's acknowledgement number, or the client's sequence number is not equal to the server's acknowledgement number.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484602036687,"text":"Which of the following are true about modes of session hijacking?","answers":[{"text":"A. Session hijacking could be either Active or Passive. This depends on the degree of involvement of the attacker.","isValid":false},{"text":"B. In an active attack, the attacker takes over an existing session by either tearing down the connection on one side of the conversation, or by actively participating as the man-in-the- middle.","isValid":false},{"text":"C. Passive attack uses sniffers on the network to obtain information such as user IDs and passwords. The attacker can later use this information to log on as a valid user and take over privileges.","isValid":false},{"text":" D. All of the above","isValid":true}],"note":"A. Session hijacking could be either active or passive in nature based on the degree of involvement of the attacker. This answer is correct. B. In an active attack, the attacker takes over an existing session either by tearing down the connection on one side of the conversation, or by actively participating as the man-in-the- middle. C. In passive attack, the user uses sniffers on the network to obtain information such as user IDs and passwords. The attacker can later use this information to log on as a valid user and take over privileges.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484602108857,"text":"Which of these statements is correct in the case of application-level hijacking?","answers":[{"text":"HTTP sessions could be hijacked by obtaining the respective session IDs, and the unique identifiers of the HTTP sessions HTTP sessions could be hijacked by obtaining the respective session IDs, and the unique identifiers of the HTTP sessions.","isValid":true},{"text":"You cannot hijack applications","isValid":false},{"text":"Network hijacking cannot be used alongwith application level hijacking","isValid":false}],"note":"A compromised session ID is all that is needed to hijack a session and the next step kicks in once you have a valid session ID.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484602173299,"text":"What is true about session sniffing?","answers":[{"text":"A. If HTTP traffic is not encrypted, you can sniff session IDs","isValid":false},{"text":"B. Attackers make use of sniffers to capture the HTTP traffic and then analyze the packets to determine session IDs.","isValid":false},{"text":"C. You cannot sniff session IDs","isValid":false},{"text":"D. Attackers cannot identify the session IDs even if they are not encrypted","isValid":false},{"text":" E. Answers A and B","isValid":true}],"note":"You can sniff the session ID, if included user ID and password is sent unencrypted. Attackers make use of sniffers to capture the HTTP traffic and then analyze the packets to determine session IDs. Unencrypted sessions may contain readily available user IDs and passwords.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484602203188,"text":"How many TCP connections are used in the man-in-the-middle attack?","answers":[{"text":"1","isValid":false},{"text":"2","isValid":true},{"text":"3","isValid":false},{"text":"None","isValid":false}],"note":"In a man-in-the-middle attack, an attacker splits the legitimate TCP connection between the client and the server into two distinct connections.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484604548669,"text":"What is the difference between a man-in-the-browser attack and a man-in-the-middle attack?","answers":[{"text":"A man-in-the-browser attack is exactly the same as a man-in-the-middle attack.","isValid":false},{"text":"The man-in-the-browser attack uses a Trojan horse to intercept and manipulate the calls between the browser and its security mechanisms or libraries. In the case of the man-in-the-middle attack, the traffic flows through him.","isValid":true},{"text":"Both can modify the data","isValid":false},{"text":"Both are totally different","isValid":false}],"note":"A man-in-the-browser attack is similar to that of a man-in-the-middle attack. The difference between the two techniques is that the man-in-the-browser attack uses a Trojan horse to intercept and manipulate the calls between the browser and its security mechanisms or libraries. This attack uses Trojans that are already installed on the system to act between the browser and its security mechanisms. This attack is capable of modifying and sniffing the transactions.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484604611519,"text":"What are different ways of initiating a client-side attack?","answers":[{"text":"Cross-site scripting attacks","isValid":false},{"text":"Malicious JavaScript Codes","isValid":false},{"text":"Trojans","isValid":false},{"text":"All of these","isValid":true}],"note":"A. Cross-site scripting attacks are a type of injection attacks where the malicious scripts are injected into websites. B. The attacker may embed a malicious JavaScript in a web page and lure you to visit that page. When you open that page in your browser, the malicious script runs silently without displaying any warning message. C. A Trojan is a malicious application that pretends to be legitimate, but the real purpose is to allow hackers to gain unauthorized access to a computer.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484604637981,"text":"Cross-site scripting is a type of vulnerability in computer security.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"A cross-site script attack is a client-side attack in which the attacker compromises the session token by making use of malicious codes or programs. This vulnerability is usually found in web applications where there is a scope of injecting client-side script into the web pages. This vulnerability can be used to bypass the access controls. The attacker injects the client-side malicious script into the web pages and sends them to the target victim to perform the cross-site script attack.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484604700503,"text":"Which steps are part of TCP/IP hijacking?","answers":[{"text":"User connection is sniffed after gaining his sequence numbers.","isValid":false},{"text":"Attacker sends a spoofed packet using the sequence number from the user's system to the host system.","isValid":false},{"text":"The host machine responds to the user, assuming that the packet has arrived from it, and increments the sequence number, thereby responding to the user’s IP.","isValid":false},{"text":"All of these","isValid":true}],"note":"User connection is sniffed after gaining his sequence numbers. The sequence number used to attack sends a spoofed packet from the user's system to the host system. The host machine responds to the user, assuming that the packet has arrived from it, and increments the sequence number, thereby responding to the user’s IP.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484604744650,"text":"What is true about blind hijacking?","answers":[{"text":"A. An attacker can inject the malicious data or commands into the intercepted communications in the TCP session, even if the source-routing is disabled.","isValid":false},{"text":"B. An attacker can send data or comments, but cannot see the response.","isValid":false},{"text":"C. Answers A and B","isValid":true}],"note":"An attacker can inject the malicious data or commands into the intercepted communications in the TCP session even if the source-routing is disabled. An attacker can send the data or comments, but has no access to see the response. Blind hijacking involves predicting the sequence numbers that the victimized host sends in order to create a connection that appears to originate from the host.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484604770291,"text":"UDP uses packet sequencing and synchronizing.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"UDP does not use packet sequencing and synchronizing. An attacker can more easily attack with a UDP session than a TCP. In this attack, the hijacker forges a server reply to the client UDP request before the server can respond. The server's reply can be easily restricted if sniffing is used. A man-in-the-middle attack in UDP hijacking can minimize the task of the attacker, as they can stop the server's reply to reach the client in the first place.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484604837511,"text":"How do you protect against session hijacking?","answers":[{"text":"Use a string or long random number as a session key","isValid":false},{"text":"Use Secure Shell (SSH) to create a secure communication channel","isValid":false},{"text":"Pass the authentication cookies over an HTTPS connection","isValid":false},{"text":"All of the above","isValid":true}],"note":"A. Use string or long random number as a session key. Session keys are very important in communication. These session keys can be determined easily with the help of a brute force attack if the length of the session key is small. To avoid this risk, you should use a string or long random number as a session key. B. Use Secure Shell (SSH) to create a secure communication channel. SSH is a protocol used for communication security over the Internet. The SSH encrypts the segments of network connections at the transport layer.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484604919486,"text":"What should the web developers consider as the guidelines to avoid the risk of session hijacking?","answers":[{"text":"Create session keys with lengthy strings or random numbers, so that it is difficult for an attacker to guess a valid session key.","isValid":false},{"text":"Encrypt the data and session key that is transferred between the user and the web servers.","isValid":false},{"text":"Prevent eavesdropping within the network.","isValid":false},{"text":"Regenerate the session ID after a successful login to prevent session fixation attacks. Expire the session as soon as the user logs out.","isValid":false},{"text":"Reduce the lifespan of a session or a cookie.","isValid":false},{"text":"All of the above","isValid":true}],"note":"If the web developers considered the guidelines mentioned and followed them, the risk of session hijacking can be avoided to an extent.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484604971942,"text":"How can an attacker get into a session?","answers":[{"text":"User can send a request with a user ID and password credentials that are fraudulently obtained to initiate a session.","isValid":true},{"text":"Attacker can enter into a site without a valid user ID, password, and session ID","isValid":false},{"text":"Attacker can get into a session when the victim is still in a session, even without a valid session ID.","isValid":false}],"note":"An attacker can fraudulently obtain user ID and password to login into a web application. An attacker can get into a session with a valid session ID.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1484605057064,"text":"Which of the following statements is correct for network level hijacking?","answers":[{"text":"A. Network level hijacking relies on hijacking transport and Internet protocols used by web applications in the application layer.","isValid":false},{"text":"B. Attacking the network level sessions, the attacker gathers critical data which can be used to attack at application level sessions.","isValid":false},{"text":" C. HTTP sessions could be hijacked by obtaining the respective session IDs from network attacks.","isValid":false},{"text":" D. Answers A and B","isValid":true}],"note":"Network level hijacking relies on hijacking transport and Internet protocols used by web applications in the application layer. Attacking the network level sessions, the attacker gathers some critical data which is used to attack the application level sessions.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484605106978,"text":"What is true about the TCP/IP hijacking technique?","answers":[{"text":"A. Systems using one-time passwords can be easily attacked","isValid":false},{"text":"B. The victim's connection is made to hang and then the attacker will be able to communicate with the host's machine as if the attacker is the victim","isValid":false},{"text":"C. It cannot be performed on a system on the same network as the victim.","isValid":false},{"text":"D. Answers A and B","isValid":true}],"note":"Systems using one-time passwords can be easily attacked through this technique. The victim's connection is made to hang and the attacker is then able to communicate with the host's machine as if the attacker is the victim. It can be performed on a system on the same network as the victim. The host machine can be located anywhere.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1484605157806,"text":"Which of the statements is incorrect when a sniffer technique used in a man-in-the-middle attack?","answers":[{"text":"Man-in-the-middle attack doesn’t use a packet sniffer to intercept the communication between the client and server.","isValid":true},{"text":"Man-in-the-middle uses a packet sniffer to intercept the communication between the client and the server.","isValid":false},{"text":"The attacker changes the default gateway of the client's machine and intends to route the packets through the hijacker's host.","isValid":false}],"note":"Man-in-the-middle attack uses a packet sniffer to intercept communication between the client and the server.","type":"MULTIPLE_CHOICE","preserveOrder":false}]