[{"id":1483383277368,"text":"Pick the one that can increase the risk of social engineering in the organization.","answers":[{"text":"Access Control List","isValid":false},{"text":"Security policy","isValid":false},{"text":"Training","isValid":false},{"text":"Ignorant Employees","isValid":true}],"note":"An ignorant employee may not even detect the presence of a social attacker and disclose valuable information about the organization, which can be harmful to the organization.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1483383341923,"text":"The security policy includes the following steps that must be taken when firing an employee, except:","answers":[{"text":"A. Monitoring his email account","isValid":false},{"text":"B. Unlimited access before he knows that he is fired","isValid":false},{"text":"C. Communicate the bad news in a public meeting","isValid":false},{"text":"D. Do not allow him to use the company computer after he is fired.","isValid":false},{"text":"E. Answers B & C","isValid":true}],"note":"Limiting his access before he knows that he is fired is a good decision to make. The fired employee may misuse the resource of the company if he is able to use them.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1483383374669,"text":"Social engineers always pretend to be a legitimate party, and depend on _____ as much as possible.","answers":[{"text":"Lies","isValid":true},{"text":"Truth","isValid":false}],"note":"Social engineers depend on lies as much as possible, but they cannot give the right story for all questions, especially if there are too many questions, from your side.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1483383395799,"text":"Any human is vulnerable to social engineering.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Social engineers target the trust factor of the employees that they have with their colleagues and friends. A social engineer might approach the victim and build a relation in order to get the information he needs.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483383413982,"text":"The lack of education and training is one of the main reasons that makes employees easy victims of social engineering.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"The failure to educate and train the employees can make it easy for the social engineers to make the employees their victims.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384059273,"text":"If a person claims high authority and refuses to answer questions, then the chances for him to be a ____ is high.","answers":[{"text":"Executive","isValid":false},{"text":"Social engineer","isValid":true}],"note":"One way to identify whether a person is a social engineer is to check whether he claims high authority and refuses to answer questions. If so, then he is suspected as a social attacker.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1483384102709,"text":"What is not true about Social Engineering?","answers":[{"text":"It uses social tactics to gain information.","isValid":false},{"text":"It uses high-end technologies.","isValid":true},{"text":"Exploits the trust of the victims.","isValid":false}],"note":"It uses low-end technologies and encourages users to work in favor of them, either for cash or high position.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1483384144403,"text":"Taking advantage of human trust to reveal sensitive information from the users, by pretending to be legitimate members of the company is known as?","answers":[{"text":"Social engineering","isValid":true},{"text":"Hacking","isValid":false},{"text":"Spoofing","isValid":false}],"note":"Social engineering hackers build a healthy relationship with the employees of the organization and pretend to be legitimate members of the company. They take advantage of the human trust and finds out sensitive information from the users, such as passwords and user ID.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1483384190286,"text":"What are the reasons behind the success of social engineering attacks?","answers":[{"text":"Lack of training","isValid":true},{"text":" Lack of strong password","isValid":false},{"text":"Lack of firewall","isValid":false}],"note":"The employees need to be trained about the different aspects of social engineering attacks and must be made aware of how the attacks are performed. Each employee in the organization must be made aware of the security policy and how much their ignorance can cause damage to the organization. Therefore, a small negligence of any of the employees can result in great damage to the organization.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1483384254096,"text":"A social engineer uses:","answers":[{"text":" A. Deception","isValid":false},{"text":"B. VPN","isValid":false},{"text":"C. Encryption","isValid":false},{"text":"D. Influence","isValid":false},{"text":"E. Both A & D","isValid":true}],"note":"A social engineer does not care for the security measures used by the company as he uses deceptive methods to gain unauthorized access to the system. A social engineer uses his influence over the employees in the company to get sensitive info like password or ID.","type":"MULTIPLE_CHOICE","preserveOrder":true},{"id":1483384271970,"text":"Creating a security policy is enough to secure your employees from social attacks.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Creating a security policy is not enough to secure the employees from the social attacks. You must organize training to show them exactly how the social attacks are performed. Also, show them how to identify a scam email and phishing site and how to identify a social attack via phone or personally.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384322901,"text":"If an employee is fired, it is advised not to allow him to use the company computer.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"If an employee is fired, it is advised not to allow him to use the company computer, as he may leak some sensitive information about the company to the competitors.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384344277,"text":"If an employee is fired, there is no need to monitor his email account.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Monitoring the email account of the fired employee is one of the most important steps to be taken to ensure the safety of the data of the organization.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384361059,"text":"Printed papers are not useless.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Printed papers are not useless, if they contain data, as it may contain at least an email address. Each and everything matters for the hackers.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384377768,"text":"Monitoring the moves of the system admin will not reveal any valuable information.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Monitoring system administrator moves are very likely to reveal valuable information.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384399584,"text":"If a person gets angry on asking for too much information, then he is identified as a social hacker.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"If the person gets angry because of too much information being required, then he is suspected as a social hacker.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384415676,"text":"Social Engineering attacks do not solely use technical means.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Social engineering exploits the trust of the employees to reveal sensitive information about the organization. The human behavior is used, instead of high-end technologies.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384433678,"text":"In Social engineering, the attacker forces an unhappy employee of the company to reveal sensitive information.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"In Social engineering, the attacker forces an unhappy employee of the company to reveal sensitive information, such as the password of the customer's account.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384450362,"text":"Social engineering works on human psychology.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Social engineering understands human psychology and influences employees to give sensitive information or grant you unauthorized access to the system.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384467520,"text":"Social engineering is the art of influencing people.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Social engineering is a way of influencing people to trick them to get their critical information, such as ID, password, bank info, etc. The aim of such people is to gain unauthorized access to the system or install malware.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384483196,"text":"A Social engineer can pretend to be an employee and seek the assistance of the help desk to gain unauthorized access.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"A social engineer can pretend to be an employee of an organization and seek the assistance of the help desk to change his password and gain unauthorized access to the account remotely.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384520657,"text":"Spear phishing is:","answers":[{"text":"Same as regular phishing email","isValid":true},{"text":"It is sent to the bulk","isValid":false}],"note":"Spear phishing works similar to any other ordinary phishing email except that it is sent to a specific user.","type":"MULTIPLE_CHOICE","preserveOrder":false},{"id":1483384545306,"text":"Computers are rarely used in social engineering attacks.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Computers are heavily used in social engineering attacks. Statistics say that 90% of the emails on the internet are spam. Every day someone in the organization receives a spam email that can trick users to send information to the hackers.","type":"TRUE_FALSE","preserveOrder":false},{"id":1483384567492,"text":"Social engineering uses hacking technology.","answers":[{"text":"TRUE","isValid":false},{"text":"FALSE","isValid":true}],"note":"Social engineering does not use any hacking technology, rather it uses human behavior.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484447663223,"text":"The fake email redirects the user to the legitimate looking website to trap the users.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Hackers design emails that look exactly like the legitimate one. These emails redirect the user to a fake website that claims to be legitimate website and record the information provided by the user, such as user account and password.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484447683775,"text":"The hacker prompts the user to provide network authentication to them.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"When the user clicks on the pop-ups in the fake websites, provided by the hacker, to know more information about the error in their computer, the network authentication is sent to the hacker.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484447701693,"text":"In Spear phishing, the opportunity to extort information is high.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"In Spear phishing, the email is not sent to bulk, instead it is sent to a specific user. The hacker will pretend to be a legitimate party and try to establish connection with the victim based on trust, therefore the opportunity to extort information increases.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484447722110,"text":"The most essential factor in an organization is data privacy.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Once your business loses its data privacy, it also loses money and credibility.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484447740110,"text":"Human greed can be a reason for a social engineering attack.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"Human greed, sympathy, friendship, and discontent employees are some of the reasons that can eventually lead to social engineering attacks.","type":"TRUE_FALSE","preserveOrder":false},{"id":1484447903407,"text":"If a person requests information or changes without written email, then he may be suspected as a social hacker.","answers":[{"text":"TRUE","isValid":true},{"text":"FALSE","isValid":false}],"note":"If a person requests information or changes without written email, then he may be suspected as a social hacker and is one of the ways to identify a hacker.","type":"TRUE_FALSE","preserveOrder":false}]